package com.kan.lannacookingv3;

import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

/**
 * Created by Kanty on 20/8/2559.
 */
public class DbHelper extends SQLiteOpenHelper {
    private static final String databaseName = "LannaCooking1.sqlte";
    private static final int databaseVersion = 2;
    private Context myContext;



    public DbHelper(Context context) {
        super(context, databaseName, null, databaseVersion);

        this.myContext = context;
        int kkd = myContext.getResources().getIdentifier("kkd","drawable",context.getPackageName());

    }

    @Override
    public void onCreate(SQLiteDatabase db) {

        //ทำตาราง cooking
        String SQLText = "CREATE TABLE cooking ("+
                "id TEXT PRIMARY KEY," +
                "name TEXT," +
                "information TEXT," +
                "item TEXT," +
                "step TEXT," +
                "trick TEXT," +
                "img TEXT);";
        db.execSQL(SQLText);

        SQLText = "INSERT INTO cooking (id, name, information, item, step,trick, img)" +
                "VALUES ('001', 'ข้าวซอยไก่', " +
                "'ข้าวซอยเป็นอาหารชนิดหนึ่งซึ่งมีที่มาจากอาหารของชาวมุสลิมโดยชาวจีนฮ่อมุสลิมซึ่งบางแห่งเรียกชื่อเต็มว่าข้าวซอยฮ่อหรือข้าวซอยอิสลามดังนั้นข้าวซอยจึงใช้เนื้อไก่และเนื้อวัวเป็นส่วนผสม', " +
                "'1.\tน่องไก่\t1\tกิโลกรัม\n" + "2.\tเส้นข้าวซอย\t1/2\tกิโลกรัม\n" +
                "3.\tน้ำมันพืช\t1\tถ้วย\n" + "4.\tกะทิ\t3\tถ้วย\n" +
                "5.\tพริกแห้ง\t10\tเม็ด\n" + "6.\tกระเทียม\t10\tกลีบ\n" +
                "7.\tหอมแดง\t10\tหัว\n" + "8.\tผิวมะกรูด\t1\tลูก\n" +
                "9.\tกระชาย\t5\tหัว\n" + "10.\tขมิ้น\t2\tชิ้น\n" +
                "11.\tตะไคร้ซอย\t2\tช้อนโต๊ะ\n" + "12.\tน้ำตาลปี๊บ\t2\tช้อนโต๊ะ\n" +
                "13.\tกะปิ\t3\tช้อนโต๊ะ\n" + "14.\tผงกะหรี่\t1\tช้อนโต๊ะ'," +

                "'1.โขลกเครื่องแกงรวมกันให้ละเอียด\n" + "2.ตั้งน้ำกะทิประมาณ 1 ถ้วยพอเดือด\n" +
                "3.ใส่เครื่องแกงผัดจนหอม \n" + "4.ใส่ผงกะหรี่ละลายน้ำเล็กน้อย\n" +
                "5.ใส่ไก่ผัดให้เข้ากันเติมน้ำเล็กน้อยใส่น้ำตาลปี๊บแล้วเติมกะทิเคี่ยวต่อจนไก่นุ่ม\n" + "6.ตั้งกระทะใส่น้ำมันพืชพอร้อนใส่เส้นข้าวซอยที่คลี่ออกจากกันแล้วทอดพอเหลืองกรอบเพื่อทำเส้นกรอบสำหรับโรยหน้า \n" +
                "7.ลวกเส้นข้าวซอยกับน้ำเดือดประมาณ 1 นาทีแล้วนำมาลวกในน้ำเย็น',"+

                "'ข้าวซอยปรุงได้ทั้งเนื้อไก่ เนื้อวัว สำหรับการทำข้าวซอยเนื้อ สำหรับการทำข้าวซอยเนื้อควรหั่นเป็นชิ้นพอคำ ต้มให้เปื่อยก่อน แล้วนำไปเคี่ยวกับเครื่องแกง\n" + "\n" +
                "เคล็ดลับในการเลือกส่วนผสม\n" + "การเลือกเนื้อไก่ ควรเลือกน่องและสะโพก สำหรับข้าวซอยเนื้อ ควรใช้เนื้อสันคอ','kkd.png');";
        db.execSQL(SQLText);

        SQLText = "INSERT INTO cooking (id, name, information, item, step,trick, img)" +
                "VALUES ('002', 'แกงผักแว่น', " +
                "'แกงผักแว่น นิยมแกงง่ายๆ ใส่เห็ดฟาง ไม่ใส่เนื้อปลา หรือเนื้อสัตว์ใดๆ กลิ่นหอมชวนรับประทานของแกงมาจากพริกหนุ่มย่างถ่านไม้ บางสูตรใส่ปลา เช่นเดียวกับแกงผักกาด แกงผักปลัง บางสูตรใส่แต่พริกหนุ่มย่างไฟ ไม่ใช้พริกหนุ่มเป็นเครื่องแกง', " +
                "'1.\tผักแว่น\t100\tกรัม\n" + "2.\tเห็ดฟาง\t200\tกรัม\n" +
                "3.\tพริกหนุ่มย่าง\t2\tเม็ด\n" + "4.\tพริกหนุ่ม\t3\tเม็ด\n" +
                "5.\tกระเทียม\t5\tกลีบ\n" + "6.\tกะปิ\t1\tช้อนโต๊ะ'," +

                "'1.โขลกพริกหนุ่มกระเทียมกะปิรวมกันให้ละเอียด\n" + "2.ต้มน้ำพอเดือดละลายเครื่องแกงในน้ำเดือด \n" +
                "3.ใส่เห็ดต้มจนเห็ดสุก\n" + "4.ใส่ผักแว่นพอเดือดปิดไฟ ',"+

                "'ควรย่างพริกหนุ่มกับถ่านไม้จะทำให้แกงหอม\nอร่อย\n" +
                "ปรุงรสด้วยซีอิ้วขาวนิดหน่อยไม่ควรใส่น้ำปลา\nเพราะจะทำให้มีกลิ่นคาว','jpk.jpg');";
        db.execSQL(SQLText);

        /*
        SQLText = "INSERT INTO cooking (id, name, information, item, step,trick, img)" +
                "VALUES ('003', 'แกงมะรุม', " +
                "'แกงมะรุม หรือแกงบ่าค้อนก้อม ใช้ฝักมะรุม หรือบ่าค้อนก้อมเป็นผักแกง นิยมแกงกับปลาแห้งหรือกระดูกหมู มีวิธีการแกงเช่นเดียวกับแกงผักเสี้ยว แกงผักหวาน แกงผักเซียงดา สูตรนี้ใช้วิธีผัดเครื่องแกงกับน้ำเล็กน้อย พอให้เครื่องหอม จึงเติมน้ำลงไป ใส่ผักชะอมและใบชะพลูลงด้วย เพื่อให้แกงหอม รสชาติกลมกล่อมยิ่งขึ้น', " +
                "'1.\tมะรุม\t2\tถ้วย\n" + "2.\tปลาแห้ง\t50\tกรัม\n" +
                "3.\tชะอมเด็ด\t1/2\tถ้วย\n" + "4.\tชะพลูหั่นหยาบ\t1/2\tถ้วย\n" +
                "5.\tพริกขี้หนูแห้ง\t10\tเม็ด\n" + "6.\tกระเทียม\t10\tกลีบ\n" +
                "7.\tหอมแดง\t3\tหัว\n" + "8.\tข่าหั่น\t1\tช้อนโต๊ะ\n" +
                "9.\tตะไคร้หั่น\t1\tช้อนโต๊ะ\n" + "10.\tกะปิ\t1/2\tช้อนโต๊ะ\n" +
                "11.\tปลาร้าต้มสุก\t1/2\tช้อนโต๊ะ\n" + "12.\tเกลือ\t1/2\tช้อนชา'," +

                "'1.ปอกเปลือกมะรุมหั่นเป็นท่อนพักไว้ \n" + "2.โขลกเครื่องแกงรวมกันให้ละเอียด\n" +
                "3.ผัดเครื่องแกงให้หอมเติมน้ำพอเดือด\nใส่ปลาแห้ง \n" + "4.ต้มพอให้ปลานุ่มใส่มะรุมต้มจนสุกนิ่ม\n" +
                "5.ใส่ชะอมใบชะพลูพอผักสุกปิดไฟ\n',"+

                "'','kkd.png');";
        db.execSQL(SQLText);

        SQLText = "INSERT INTO cooking (id, name, information, item, step,trick, img)" +
                "VALUES ('004', 'แกงขนุน', " +
                "'แกงขนุน หรือ แกงบ่าหนุน ถือว่าเป็นแกงที่มีชื่อเป็นมงคล บางท่านนิยมแกงกินในงานแต่งงาน เพื่อเป็นเคล็ดว่าให้คู่แต่งงานนั้นมีความเกื้อหนุนจุนเจือต่อกัน และในวันปากปี คือหลังวันเถลิงศก (วันพญาวัน) หนึ่งวัน บางแห่งนิยมใส่ข่า ตะไคร้ทุบ และอาจมีจักข่าน (สะค้าน) บ่าแขว่น (ผลกำจัด) โขลกใส่ลงไปในแกงด้วย', " +
                "'1.\tขนุนอ่อน\t300\tกรัม\n" + "2.\tซี่โครงหมูสับ\t100\tกรัม\n" +
                "3.\tมะเขือเทศลูกเล็ก\t5\tลูก\n" + "4.\tชะอมเด็ด\t1/2\tถ้วย\n" +
                "5.\tชะพลูหั่นหยาบ\t1/2\tถ้วย\n" + "6.\tพริกแห้ง\t5\tเม็ด\n" +
                "7.\tกระเทียม\t5\tกลีบ\n" + "8.\tหอมแดง\t5\tหัว\n" +
                "9.\tกะปิ\t1\tช้อนชา\n" + "10.\tเกลือ\t1\tช้อนชา'," +

                "'1.โขลกเครื่องแกงรวมกันให้ละเอียด\n" + "2.ต้มน้ำเปล่าพอเดือดละลายเครื่องแกง\nลงในน้ำเดือด \n" +
                "3.ใส่ซี่โครงหมูต้มจนหมูนุ่ม\n" + "4.ใส่ขนุนต้มให้ขนุนนิ่ม\n" +
                "5.ใส่มะเขือเทศชะอมและใบชะพลูคนให้เข้ากันพอผักสุกปิดไฟ\n',"+

                "'เมื่อแกงสุกแล้วไม่ควรปิดฝาหม้อทันที ทิ้งไว้สักครู่ให้แกงเย็นลงบ้าง เพื่อให้ใบชะพลูและใบชะอมไม่สุกจนเกินไป จะทำให้รสชาติแกงไม่กลมกล่อม\n" +
                "\n" + "เคล็ดลับในการเลือกส่วนผสม\n" +
                "ขนุนต้องใช้ขนุนอ่อนที่เม็ดยังไม่แก่ จึงจะทำให้ขนุนเปื่อยง่าย ควรเลือกขนุนอ่อนพันธุ์ทวายทั้งปี หรือพันธ์อื่นๆ ที่มีเนื้อแน่น รสชาติของน้ำแกงจะกลมกล่อมยิ่งขึ้น','kkd.png');";
        db.execSQL(SQLText);

        SQLText = "INSERT INTO cooking (id, name, information, item, step,trick, img)" +
                "VALUES ('005', 'จอผักกาด', " +
                "'จอผักกาดเป็นตำรับอาหารที่ใช้ผักกาดกวางตุ้งที่กำลังออกดอกหรือเรียกว่าผัก" +
                "กาดจ้อนหรือผักกาดดอกซึ่งปรุงด้วยเกลือกะปิปลาร้าหรือกะปิปรุงรสด้วยน้ำมะขามเปียก" +
                "หรือมะขามสดใส่กระดูกหมูด้วยก็ได้ซึ่งบางแห่งนิยมใส่น้ำอ้อยลงไปด้วยบางสูตรใส่ถั่วเน่าแข็บ" +
                "หรือถั่วเน่าแผ่นย่างไฟนิยมรับประทานกับพริกแห้งทอดตัดเป็นท่อนโรยหน้าแกงหรือรับประทานต่างหากแล้วแต่ชอบ', " +
                "'1.\tผักกาดกวางตุ้ง\t1\tกิโลกรัม\n" +
                "2.\tซี่โครงหมู\t400\tกรัม\n" +
                "3.\tหอมแดง\t5\tหัว\n" +
                "4.\tกระเทียม\t10\tกลีบ\n" +
                "5.\tถั่วเน่าแข็บย่างไฟ\t2\tแผ่น\n" +
                "6.\tกะปิ\t2\tช้อนโต๊ะ\n" +
                "7.\tน้ำมะขามเปียก\t3\tช้อนโต๊ะ\n" +
                "8.\tเกลือป่น\t1\tช้อนชา\n" +
                "9.\tน้ำมันพืช\t2\tช้อนโต๊ะ'," +

                "'1. ต้มน้ำเปล่า พอเดือด ใส่ซี่โครงหมูสับ ต้มจนกระทั่งหมูนุ่ม\n" +
                "2. โขลกกระเทียม หอมแดง กะปิ เกลือ รวมกันให้ละเอียด ใส่ลงในหม้อต้มซี่โครงหมู \n" +
                "3. พอเดือด ใส่ผักกวางตุ้งเด็ดเป็นท่อน \n" +
                "4. พอผักนุ่ม ใส่ถั่วเน่าแผ่นโขลกละเอียด \n" +
                "5. ใส่น้ำมะขามเปียก คนให้ทั่ว พอเดือด ปิดไฟ\n" +
                "6. ตั้งกระทะใส่น้ำมัน พอร้อน ใส่พริกขี้หนูแห้งลงทอด พอกรอบ ตักขึ้น ใส่กระเทียมสับ เจียวให้เหลือง เททั้งกระเทียมเจียวและน้ำมัน ใส่หม้อจอผักกาด (จ่าว) คนให้เข้ากัน',"+

                "'บางสูตรใส่ปลาร้า หรือบางสูตรใส่น้ำอ้อยเพื่อให้มีรสหวาน\n" +
                "ถ้าใช้มะขามสด ให้ลวก หรือเผา แล้วแกะเอาเปลือกออก เลือกเอาแต่เนื้อและน้ำ เพื่อนำไปปรุงรส รสชาติของจอผักกาดจะกลมกล่อม เลือกผักกาดกวางตุ้งที่ใหม่และสด จะทำให้จอผักกาดมีรสชาติกลมกล่อม','IMG');";
        db.execSQL(SQLText);
        */

    }

    @Override
    public void onUpgrade(SQLiteDatabase sqLiteDatabase, int i, int i1) {

    }
}
